---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RailingSystemHasTopRail
source: html/0bee613b-8efc-bb47-d20a-d85ced7549b2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RailingSystemHasTopRail Property

"Use Top Rail": Whether railing has top rail

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemHasTopRail { get; }
```